{"data":{"resourcePage":{"path":"/p/6824","iid":6824,"title":"Combined notes February 26th 2019","date":"February 26th 2019","links":[{"link":"https://diabeteslibrary.org/diabetic-snack-ideas/","txt":"Anytime, Low Calorie Snacks for the Hungry Diabetic","extract":""},{"link":"https://diabeteslibrary.org/diabetic-recipes-for-breakfast/","txt":"Healthy, Low Calory Diabetic Recipes for Breakfast","extract":"The Diabetes Association has noted that breakfast is a meal that most people are inclined to miss. The main reasons for this include the fact that some people just do not like to eat in the morning, while others might find weekday mornings just too busy to prepare and eat a meal."},{"link":"https://doi.org/10.4103/2230-8210.94253","txt":"Infections in patients with diabetes mellitus: A review of pathogenesis Casqueiro J, Casqueiro J, Alves C - Indian J Endocr Metab","extract":""},{"link":"https://diabeteslibrary.org/diabetes-meal-and-diet/","txt":"A Comprehensive Guide to Diabetes Meal Planning and Diet","extract":""},{"link":"https://diabeteslibrary.org/low-calory-diabetic-recipes-for-dinner/","txt":"Low Calory Diabetic Recipes for Dinner","extract":"Glycemic index or GI, is a measurement carried out on carbohydrate foods that may have an effect on our blood sugar. This relatively new way of analysing food, is especially important to people suffering from diabetes. GI measurements fall into 3 categories – low, medium, and high."},{"link":"http://www.thehealthsite.com/diseases-conditions/7-tips-for-diabetics-to-reducing-swelling-in-the-feet-sh314/","txt":"7 tips for diabetics to reduce swelling in the feet | TheHealthSite.com","extract":"2. Elevate your legs: Elevation of feet (above the heart level) using a support or a pillow for 10-15 minutes every day can help to reduce swelling. Elevation drains out excess fluid from the surrounding tissues and improves circulation."},{"link":"http://www.healthline.com/health/type-2-diabetes/skin-problems#overview1","txt":"Type 2 Diabetes and Skin: Pictures, Dermopathy, Infections, and More","extract":"Type 2 diabetes is a chronic metabolic condition that affects how your body utilizes glucose (sugar). This happens when the body either doesn’t respond normally to insulin or doesn’t produce enough insulin to maintain a normal blood sugar level.Decreased blood circulation can lead to changes in the skin’s collagen. This changes the skin’s texture, appearance, and ability to heal.For this reason, people with type 2 diabetes should watch out for:They’re caused by damage to the small blood vessels that supply the tissues with nutrition and oxygen. This skin problem is harmless and doesn’t require treatment. However, it often doesn’t go away, even when blood glucose is controlled.This condition is rarer than diabetic dermopathy. In the case of NLD, though, the patches are often larger in size and fewer in number. Over time, NLD skin patches may appear shiny with a red or violet border. They’re usually itchy and painful.Elevated blood sugar can increase the risk of developing digital sclerosis. Lotions, moisturizers, and regulated blood sugar levels can help prevent or treat the condition.They’re harmless, and medications are available for treatment.Blisters of this type typically occur only if blood glucose isn’t controlled.While some skin conditions associated with type 2 diabetes are mostly harmless and will go away on their own, some can be much more dangerous. If you have a flare-up of a new skin condition listed above, make an appointment to see your doctor as soon as possible."},{"link":"http://www.diabetes.co.uk/diabetes-and-skin-care.html","txt":"Diabetes and Skin Care","extract":"Skin care  is an important factor for people with diabetes. Skin  conditions can be more likely amongst diabetics, and reduced  sensitivity of nerves and circulation can often make it harder to spot emerging  skin problems."},{"link":"http://www.diabetes.org.nz/about_diabetes/complications_of_diabetes/general_skin_conditions","txt":"","extract":""},{"link":"https://diabeteslibrary.org/easy-diabetic-recipes/","txt":"Selected Quick, Easy Diabetic Recipes","extract":""}]}},"context":{}}