{"data":{"resourcePage":{"path":"/p/5878","iid":5878,"title":"Resources set 5878","date":"March 14th 2018","links":[{"link":"https://doi.org/10.2337/diacare.27.8.1879","txt":"","extract":""},{"link":"https://doi.org/10.4274/jcrpe.v2i1.46","txt":"","extract":""},{"link":"https://diabeteslibrary.org/diabetes-and-dry-skin/","txt":"Diabetes Dry Skin – Best Remedies","extract":""},{"link":"https://diabeteslibrary.org/diabetes-and-nausea/","txt":"Diabetes and Nausea","extract":""},{"link":"https://diabeteslibrary.org/diabetes-and-weight-gain/","txt":"Diabetes and Weight Gain","extract":"Insulin is a natural, protein-based hormone produced by the pancreas in normal people.  Its function is to promote the absorption of glucose into the cells to be used for cellular fuel. It also manages the absorption and storage of amino acids and fat by cells of the body that are sensitive to insulin (which are mainly the fat and muscle cells)."},{"link":"https://diabeteslibrary.org/glycated-hemoglobin-test/","txt":"Glycated Hemoglobin Test","extract":"The glycated hemoglobin test is based on the amount of sugar (glucose) attached to the hemoglobin inside of red blood cells.  Hemoglobin is the protein within the red blood cells that transfer oxygen to the tissues from the lungs.  As the red blood cells are being formed, hemoglobin is a part of the making of the cells.  If the hemoglobin is exposed to high blood glucose levels during the making of a red blood cell, the end result is an elevated glycated hemoglobin test.  A normal glycated hemoglobin level is anything less than 5.7."},{"link":"https://doi.org/10.2337/dc10-9990","txt":"","extract":""},{"link":"https://diabeteslibrary.org/diabetes-rash/","txt":"Diabetes Rash","extract":"Most skin rashes in diabetes are the direct result of having out of control diabetes that can be managed by getting the diabetes under good control.  This means checking the blood sugars regularly and following the doctor’s orders in treating the diabetes with medications."},{"link":"https://doi.org/10.1089/wound.2012.0437","txt":"","extract":""},{"link":"http://www.healthline.com/health/type-2-diabetes/skin-problems#overview1","txt":"Type 2 Diabetes and Skin: Pictures, Dermopathy, Infections, and More","extract":"Type 2 diabetes is a chronic metabolic condition that affects how your body utilizes glucose (sugar). This happens when the body either doesn’t respond normally to insulin or doesn’t produce enough insulin to maintain a normal blood sugar level.Decreased blood circulation can lead to changes in the skin’s collagen. This changes the skin’s texture, appearance, and ability to heal.For this reason, people with type 2 diabetes should watch out for:They’re caused by damage to the small blood vessels that supply the tissues with nutrition and oxygen. This skin problem is harmless and doesn’t require treatment. However, it often doesn’t go away, even when blood glucose is controlled.This condition is rarer than diabetic dermopathy. In the case of NLD, though, the patches are often larger in size and fewer in number. Over time, NLD skin patches may appear shiny with a red or violet border. They’re usually itchy and painful.Elevated blood sugar can increase the risk of developing digital sclerosis. Lotions, moisturizers, and regulated blood sugar levels can help prevent or treat the condition.They’re harmless, and medications are available for treatment.Blisters of this type typically occur only if blood glucose isn’t controlled.While some skin conditions associated with type 2 diabetes are mostly harmless and will go away on their own, some can be much more dangerous. If you have a flare-up of a new skin condition listed above, make an appointment to see your doctor as soon as possible."}]}},"context":{}}