{"data":{"resourcePage":{"path":"/p/1989","iid":1989,"title":"February 13th 2018 notes 1989 ","date":"February 13th 2018","links":[{"link":"https://diabeteslibrary.org/gymnema-sylvestre-and-diabetes/","txt":"Gymnema Sylvestre and Diabetes","extract":"In today’s time, Gymnema sylvestre is used in the management of metabolic syndrome, diabetes mellitus, cough, and weight loss.  In Africa, it is used to treat malaria and as an antidote for snake bites.  Some Ayurvedic doctors use Gymnema sylvestre as a laxative, a diuretic, an appetite suppressant, and as a stimulant for the digestive tract."},{"link":"https://diabeteslibrary.org/insulin-and-weight-gain/","txt":"Can Insulin Cause Weight Gain?","extract":""},{"link":"https://diabeteslibrary.org/how-to-reverse-prediabetes/","txt":"How to Reverse Prediabetes","extract":"These patients with prediabetes have a little bit of insulin resistance, which causes greater than normal blood glucose levels and which sets the stage for type 2 diabetes and the complications that come out of having the disease.  Recent research, published in The Lancet, a major medical journal, showed that prediabetics that had at least a single normal blood glucose reading, were 56 percent more likely to prevent their turning into type 2 diabetics in the next six years.\n"},{"link":"https://diabeteslibrary.org/wine-and-diabetes/","txt":"Things You Should Know About Wine and Diabetes","extract":"There is some evidence that, when a person with diabetes drinks a moderate amount of red wine per day, they could decrease their chances of heart disease.  Other evidence indicates that no amount of alcohol should be taken in by diabetics.\n"},{"link":"http://www.thehealthsite.com/diseases-conditions/7-tips-for-diabetics-to-reducing-swelling-in-the-feet-sh314/","txt":"7 tips for diabetics to reduce swelling in the feet | TheHealthSite.com","extract":"2. Elevate your legs: Elevation of feet (above the heart level) using a support or a pillow for 10-15 minutes every day can help to reduce swelling. Elevation drains out excess fluid from the surrounding tissues and improves circulation."},{"link":"https://diabeteslibrary.org/diabetes-prevention-methods/","txt":"Diabetes Prevention Methods","extract":"As there is currently no cure for diabetes, the condition requires lifelong treatment. The problem with diabetes is that it affects the nerves, feet, eyes, kidneys, and heart. In the United States, more than 20% of diabetics suffer from cardiovascular diseases, 10% are diagnosed with stroke, about 250 in 100,000 diabetics will need hemodialysis for kidney failure compared to 15 in 100,000 of the normal population."},{"link":"https://doi.org/10.4103/2230-8210.94253","txt":"Infections in patients with diabetes mellitus: A review of pathogenesis Casqueiro J, Casqueiro J, Alves C - Indian J Endocr Metab","extract":""},{"link":"http://www.diabetes.co.uk/diabetes-and-amputation.html","txt":"Diabetes and Amputation","extract":"Diabetes, when present in the body over many years, can give rise to all sorts of complications. These include heart disease, kidney disease, retinopathy and neuropathy.Damage to the foot could include any of the following:"},{"link":"http://www.webmd.com/diabetes/guide/related-skin-conditions","txt":"Diabetes and Your Skin","extract":"Other infections include:\n          Vitiligo: This condition affects your skin color. It's more common with type 1 diabetes. With vitiligo, the cells that make the substance that gives your skin color, melanin, are destroyed.\n          Scleredema diabeticorum: This condition causes a thickening of the skin on the back of the neck and upper back. It's rare, but it can affect people with type 2 diabetes. The treatment is to bring your blood sugar levels under control. Lotions and moisturizers might help soften your skin. "},{"link":"https://doi.org/10.2337/diaclin.25.3.90","txt":"","extract":""}]}},"context":{}}