{"data":{"resourcePage":{"path":"/p/8369","iid":8369,"title":"August 18th 2018 bookmarks","date":"August 18th 2018","links":[{"link":"https://diabeteslibrary.org/diabetes-nutrition-guidelines/","txt":"Diabetes Nutrition Guidelines","extract":"In selecting a meal plan that is good for diabetics, individuals should look at their metabolic goals, such as their blood sugar levels, lipid levels, and blood pressure.  This means choosing foods that are healthy for you, low in sugar, have a low glycemic index, low fat, and low in salt."},{"link":"https://diabeteslibrary.org/insulin-to-carb-ratio/","txt":"Insulin to Carb Ratio","extract":"When using the insulin to carb ratio, it is assumed that the carbohydrates we take in are responsible for increasing the blood glucose levels.  Carbohydrates include simple sugars, fiber, complex carbohydrates, and starch.  Fiber is not usually counted as part of the insulin to carb ratio because it doesn’t break down well in the gastrointestinal tract and therefore does not increase the blood glucose levels as much as other types of carbohydrates.  Fats and protein content are not counted in the insulin to carb ratio because they, too, do not increase the blood glucose level as much as carbohydrates.\n"},{"link":"https://doi.org/10.4158/EP.9.5.406","txt":"An Error Occurred Setting Your User Cookie","extract":""},{"link":"https://diabeteslibrary.org/diabetic-exchange-list/","txt":"The Diabetic Exchange List (Exchange Diet)","extract":"The exchange list was created mainly for those individuals who suffer from type 1 or type 2 diabetes; however, it can be used by anyone who needs a particular diet and even those who want to eat healthy foods as part of their daily diet plan. The foods on the exchange list are all basically healthy for you and can be used by anyone."},{"link":"https://diabeteslibrary.org/high-triglyceride-diet/","txt":"High Triglyceride Diet","extract":"There are many things you can do in order to lower your triglyceride level besides exercise.  Any time you modify your diet to reduce triglyceride intake and step up the exercise, you will lose weight, which automatically reduces the triglyceride levels by up to half of what they were originally."},{"link":"https://doi.org/10.3238/arztebl.2009.0032","txt":"Hyperhidrosis (16.01.2009)","extract":"Reinhardtstr. 34 · 10117 Berlin\n                                            Telefon: +49 (0) 30 246267 - 0\n                                            Telefax: +49 (0) 30 246267 - 20\n                                            E-Mail: aerzteblatt@aerzteblatt.de"},{"link":"http://emedicine.medscape.com/article/237378-overview","txt":"Diabetic Foot Infections: Practice Essentials, Background, Pathophysiology","extract":"Burke A Cunha, MD Professor of Medicine, State University of New York School of Medicine at Stony Brook; Chief, Infectious Disease Division, Winthrop-University Hospital\n       Burke A Cunha, MD is a member of the following medical societies: American College of Chest Physicians, American College of Physicians, Infectious Diseases Society of AmericaDisclosure: Nothing to disclose."},{"link":"https://www.diabetesselfmanagement.com/managing-diabetes/blood-glucose-management/hypoglycemia-symptoms/","txt":"Hypoglycemia Symptoms - How to Manage Your Diabetes | Diabetes Self-Management","extract":"\nOften, however, the most education a person receives on the signs and symptoms of hypoglycemia is a handout listing its 10 most common symptoms. This is particularly true for adults. But, as any longtime user of insulin will tell you, such a list does not go far enough in describing how those common symptoms can feel, and it misses some important, albeit not-so-common, symptoms of hypoglycemia.What do you want to read about?"},{"link":"https://diabeteslibrary.org/diabetes-food-list/","txt":"Diabetes Food List","extract":""},{"link":"http://www.nhs.uk/news/2015/01January/Pages/Inactivity-twice-as-deadly-as-obesity.aspx","txt":"Inactivity 'twice as deadly' as obesity - Health News - NHS Choices","extract":"Researchers wanted to see how many deaths could theoretically be avoided if inactive people became more active, compared to how many would be avoided if obese people lost weight.Studies have linked excessive sitting with being overweight and obese, type 2 diabetes, some types of cancer, and premature death.Physical inactivity kills twice as many as obesity, new study claims. The Independent, January 15 2015"}]}},"context":{}}