{"data":{"resourcePage":{"path":"/p/8209","iid":8209,"title":"Resources set 8209","date":"June 28th 2019","links":[{"link":"https://diabeteslibrary.org/legs-swelling-causes-and-remedies/","txt":"Diabetic Legs Swelling Causes and Remedies","extract":"Let us look in detail at some leading causes of swelling of legs in diabetes."},{"link":"https://diabeteslibrary.org/diabetes-itchy-skin/","txt":"Diabetes and Itchy Skin – Skin Care for Diabetic Patients","extract":"The answer to this questions lies in blood vessels and nerves. In diabetics there is poor blood flow to some parts of the skin (high blood glucose damages large and small blood vessels), decreased in sensation (high sugar also damages nerves), and not all parts of the skin are equally moistened. Some parts may sweat more than normal, while other may remain dry. All these factors together decrease the local immunity of skin. Thus small cuts and wounds may remain unnoticed until there is a full-blown infection. Once infected, infection is harder to control in diabetics, due to poor local immunity and blood supply. Thus, itching of the skin is one of the earliest signs that should not be neglected(“Type 2 Diabetes and Skin Health,” n.d.)."},{"link":"https://diabeteslibrary.org/diabetic-skin-conditions/","txt":"Diabetic Skin Conditions and Skin Care Instructions","extract":"Several skin conditions can be directly related to either having diabetes mellitus in good control or having diabetes in poor control. Diabetes in good control can still lead to skin problems but, in fact, having good glucose control over diabetes can positively affect the quality of the skin and can reduce the incidence of the more severe and difficult-to-control skin problems of diabetes."},{"link":"https://doi.org/10.1089/dia.2010.0063","txt":"","extract":""},{"link":"https://diabeteslibrary.org/diabetic-wounds-care-and-healing/","txt":"Diabetic Wounds Care and Healing","extract":""},{"link":"http://emedicine.medscape.com/article/237378-overview","txt":"Diabetic Foot Infections: Practice Essentials, Background, Pathophysiology","extract":"Burke A Cunha, MD Professor of Medicine, State University of New York School of Medicine at Stony Brook; Chief, Infectious Disease Division, Winthrop-University Hospital\n       Burke A Cunha, MD is a member of the following medical societies: American College of Chest Physicians, American College of Physicians, Infectious Diseases Society of AmericaDisclosure: Nothing to disclose."},{"link":"http://www.webmd.com/diabetes/guide/related-skin-conditions","txt":"Diabetes and Your Skin","extract":"Other infections include:\n          Vitiligo: This condition affects your skin color. It's more common with type 1 diabetes. With vitiligo, the cells that make the substance that gives your skin color, melanin, are destroyed.\n          Scleredema diabeticorum: This condition causes a thickening of the skin on the back of the neck and upper back. It's rare, but it can affect people with type 2 diabetes. The treatment is to bring your blood sugar levels under control. Lotions and moisturizers might help soften your skin. "},{"link":"http://www.diabetesforecast.org/2014/07-jul/13-tips-for-healthy-feet.html","txt":"13 Tips for Healthy Feet: Diabetes Forecast®","extract":""},{"link":"https://doi.org/10.2337/dc10-0393","txt":"","extract":""},{"link":"https://diabeteslibrary.org/diabetes-and-excessive-sweating/","txt":"Diabetes and Excessive Sweating – Likely Causes and Remedies","extract":"Our nervous system controls many functions. It is divided into voluntary and autonomous nervous system. The voluntary nervous system is needed for most of the physical moments,whereas autonomous nervous system as the name says, automatically controls the functioning of various organs.The autonomous system plays a major role in controlling the body temperature. Generalized neuropathy is characteristic of diabetes, which means that our autonomous nervous system loses its efficiency in controlling the body temperature and other functions, or at least the capacity of controlling is diminished to some extent. It often leads to excessive sweating(“Diabetes and abnormal sweating,” n.d.)."}]}},"context":{}}