{"data":{"resourcePage":{"path":"/p/8064","iid":8064,"title":"Notes on June 30th 2019","date":"June 30th 2019","links":[{"link":"https://doi.org/10.1007/s13300-012-0004-9","txt":"Management of Diabetic Foot Ulcers | SpringerLink","extract":"Diabetic foot ulceration is a major health problem and its management involves a multidisciplinary approach. This review aims to provide a synopsis of the current management strategies of diabetic foot ulcers, from prevention to the options for treatment. The authors believe that it may be useful to primary care physicians, nurses, podiatrists, diabetologists, and vascular surgeons, as well as all healthcare providers involved in the prevention or management of diabetic foot ulcers.In patients with peripheral diabetic neuropathy, loss of sensation in the feet leads to repetitive minor injuries from internal (calluses, nails, foot deformities) or external causes (shoes, burns, foreign bodies) that are undetected at the time and may consequently lead to foot ulceration. This may be followed by infection of the ulcer, which may ultimately lead to foot amputation, especially in patients with peripheral arterial disease.The physician should also assess skin temperature with the back of the hand. Normal skin temperature ranges from warm at the tibia to cool at the distal toes [20]. Foot-skin temperature can be measured with a handheld infrared thermometer on the plantar aspect of the foot at the level of the first metatarsal head. Elevated temperature is reported to be associated with sudomotor dysfunction and a higher risk for foot ulceration [21, 22].Enzymatic debridement can be achieved using a variety of enzymatic agents, including crab-derived collagenase, collagen from krill, papain, a combination of streptokinase and streptodornase, and dextrans. These are able to remove necrotic tissue without damaging the healthy tissue. Although expensive, enzymatic debridement is indicated for ischemic ulcers because surgical debridement is extremely painful in these cases [31].The results of the subcutaneous administration of granulocyte colony-stimulating factor (GCFS) in patients with infected foot ulcers vary, with some studies indicating faster resolution of the infection and faster healing [55, 56], while others did not report any significant difference [57, 58]. Basic fibroblast growth factor (bFGF) is known to be beneficial in the formation of granulation tissue and normal healing [59]; however, one small study failed to prove any significant difference between the intervention and the control group [60]. Epidermal growth factor (EGF) acts on epithelial cells, fibroblasts, and smooth muscle cells to promote healing [61]. Evidence for the use of EGF in diabetic ulcers is limited, with only a small amount of data reporting a significantly higher rate of ulcer healing with EGF use compared with placebo [62].\n                    This article is published under an open access license.\n                    Please check the 'Copyright Information' section for details of this license and\n                    what re-use is permitted.\n                    If your intended use exceeds what is permitted by the license or if\n                    you are unable to locate the licence and re-use information,\n                    please contact the Rights and Permissions team.\n                \n                    Not logged in\n                    Not affiliated\n                    157.45.31.208\n                "},{"link":"https://diabeteslibrary.org/honey-and-diabetes/","txt":"Honey And Diabetes","extract":"Type 1 diabetes involves the production of autoantibodies that act against pancreatic cells that normally produce insulin.  This deficiency in the pancreatic function results in low insulin levels. In type 2 diabetics, the pancreas may be functioning normally but the insulin produced isn’t used well and metabolism suffers.  Rather than using glucose for fuel, the glucose passes through the kidneys and blood sugar will show up in a urinalysis."},{"link":"https://diabeteslibrary.org/fish-oil-lowers-triglycerides-with-little-or-no-glycemic-effect-in-type-2-diabetics/","txt":"Fish Oil Lowers Triglycerides With Little or No Glycemic Effect in Type 2 Diabetics","extract":"Scientific research has indicated that people who eat a lot of omega 3 fatty acids from eating fish or taking fish oil supplements have a decreased incidence of coronary heart disease. Eskimos, who eat a lot of fish oil in their diet, have decreased triglyceride levels, decreased cholesterol levels, and decreased incidence of heart disease when compared to people who live nearby in Denmark but that eat lesser amounts of fish. Other research has pointed to the fact that people who ate fish at least once weekly had decreased death rates from heart disease than those who didn’t eat fish."},{"link":"http://emedicine.medscape.com/article/237378-overview","txt":"Diabetic Foot Infections: Practice Essentials, Background, Pathophysiology","extract":"Burke A Cunha, MD Professor of Medicine, State University of New York School of Medicine at Stony Brook; Chief, Infectious Disease Division, Winthrop-University Hospital\n       Burke A Cunha, MD is a member of the following medical societies: American College of Chest Physicians, American College of Physicians, Infectious Diseases Society of AmericaDisclosure: Nothing to disclose."},{"link":"https://diabeteslibrary.org/how-many-carbohydrates-should-a-person-with-diabetes-eat-each-day/","txt":"How Many Carbohydrates Should A Person With Diabetes Eat Each Day?","extract":"It is understood by nutritionists that your carbohydrate intake strongly affects your blood sugar levels—even more than the amount of protein and fat you consume in your diet. If you eat too many carbs in any given day, your blood sugar levels may be high.  In the same way, taking medications to lower the glucose level may cause you to have low blood sugar, also known as hypoglycemia."},{"link":"http://www.webmd.com/diabetes/guide/diabetes-skin-care","txt":"Diabetes and Dry Skin: 6 Tips for Diabetics Battling Dry Skin","extract":"\n          Be aware. If you have diabetic nerve damage, which is called neuropathy, you could have an infected cut, scratch, or skin puncture and not know it. Don't let a small problem turn into a big one. Be aware of your body. Check your legs, ankles, feet, and in between your toes every day for new wounds or old ones that never seem to heal."},{"link":"https://doi.org/10.1089/dia.2010.0063","txt":"","extract":""},{"link":"https://diabeteslibrary.org/coenzyme-q10-and-diabetes/","txt":"Coenzyme Q 10: A little Known Supplement That Yields Big Results","extract":""},{"link":"http://www.md-health.com/Diabetes-Swollen-Feet.html","txt":"How Diabetes Causes Swollen Feet and 7 Ways to Help | MD-Health.com","extract":"Diabetes can be divided into two categories – type 1 diabetes and type 2 diabetes. You develop type 2 diabetes when your blood sugar levels go up due to obesity or bad diet. This leads to several complications and most of these problems are associated with the feet."},{"link":"https://diabeteslibrary.org/sugar-alcohols/","txt":"Sugar Alcohols","extract":"Any food that says it is “sugar free” or says that “no sugar is added”, are likely to contain sugar alcohols instead of simple sugars.  Even though they are lower in calories than their sugar-containing counterparts, they are still carbohydrates that have the capacity to increase your blood sugar levels."}]}},"context":{}}