{"data":{"resourcePage":{"path":"/p/8321","iid":8321,"title":"Bookmarks March 23rd 2018 ","date":"March 23rd 2018","links":[{"link":"http://ispub.com/IJIM/6/2/10375","txt":"Internet Scientific Publications","extract":"Excess weight gain has been considered one of the primary adverse effects for patients treated with insulin therapy (16,17,18,19). The amount of weight gain observed may increase as more intensive insulin treatment programs are utilized. As found in the Diabetes Control and Complications Trial (DCCT), patients who were treated with intensive insulin therapy gained 4.75 kg more than patients on conventional therapy (10). In a smaller study, among 14 patients with type 2 diabetes, treated with an intensive insulin program over 6 months, there was an increase in body weight from 93.5 (± 5.8) to 102.2 (± 6.8) kg (P<0.001) (20). Weight gain associated with insulin therapy is believed to be primarily due to the anabolic effects of insulin, an increase in appetite, and reduction of glycosuria (18,21). It has been suggested that actions of the basal insulin analog, insulin detemir, in both the liver and brain, may contribute to the explanation of favorable weight characteristics that have been associated with its use. As insulin detemir is bound to albumin, it has easy access through the hepatic sinusoids, directly into the liver. This might lead to a preferential effect on the liver and relatively reduced effect in the periphery, which more closely approximates physiological insulin action as compared to the other basal insulin formulations, and could cause similar plasma glucose levels with less hypoglycemia and weight gain (25,45). In a study involving mice, insulin detemir was found to act faster and more predominantly in the brain, as measured by an altered pattern of insulin-receptor signalling, as compared with human insulin. This marked activation of insulin signalling in the brain may be involved in preventing overeating and weight gain (46)."},{"link":"https://diabeteslibrary.org/low-sugar-alcohol/","txt":"Low Sugar Alcoholic Drinks for Diabetics & the Effect of Alcohol on Diabetes","extract":"Most experts say that it’s perfectly okay for a type 1 or type 2 diabetic to have a beer or two, or a glass of wine with their meal and won’t face any major complication as long as they are otherwise vigilant about taking care of their blood sugar and don’t have other health problems, such as hypertension, which may be adversely affected by drinking too much."},{"link":"http://www.webmd.com/diabetes/guide/related-skin-conditions","txt":"Diabetes and Your Skin","extract":"Other infections include:\n          Vitiligo: This condition affects your skin color. It's more common with type 1 diabetes. With vitiligo, the cells that make the substance that gives your skin color, melanin, are destroyed.\n          Scleredema diabeticorum: This condition causes a thickening of the skin on the back of the neck and upper back. It's rare, but it can affect people with type 2 diabetes. The treatment is to bring your blood sugar levels under control. Lotions and moisturizers might help soften your skin. "},{"link":"https://diabeteslibrary.org/sugar-cravings-at-night/","txt":"Why Am I Craving Sugar All of a Sudden and Remedies","extract":""},{"link":"https://doi.org/10.2337/diaclin.25.3.90","txt":"","extract":""},{"link":"http://www.diabetes.co.uk/diabetes-and-amputation.html","txt":"Diabetes and Amputation","extract":"Diabetes, when present in the body over many years, can give rise to all sorts of complications. These include heart disease, kidney disease, retinopathy and neuropathy.Damage to the foot could include any of the following:"},{"link":"https://diabeteslibrary.org/diabetes-prevention-diet-2/","txt":"Diabetes Prevention Diet and Recipes","extract":""},{"link":"https://diabeteslibrary.org/foods-that-lower-a1c/","txt":"Foods That Lower A1c","extract":""},{"link":"https://diabeteslibrary.org/insulin-resistance-diet-recipes/","txt":"Insulin Resistance Diet Recipes","extract":""},{"link":"https://doi.org/10.2337/dc10-0393","txt":"","extract":""}]}},"context":{}}