{"data":{"resourcePage":{"path":"/p/6418","iid":6418,"title":"Notes on March 27th 2019","date":"March 27th 2019","links":[{"link":"https://diabeteslibrary.org/gestational-diabetes-diagnosis-and-tests/","txt":"Gestational Diabetes Diagnosis and Tests","extract":"Recent research has indicated that, when the gestational diabetes is adequately managed, there are benefits to both the mother and the newborn baby.  Some benefits in managing gestational diabetes include decreased chances of nerve palsies, fractures, and shoulder dystocia in the newborn. There are fewer cases of neonatal hypoglycemia (low blood sugar in the newborn) when the gestational diabetes has been managed."},{"link":"http://www.apma.org/Learn/FootHealth.cfm?ItemNumber=981","txt":"","extract":""},{"link":"https://diabeteslibrary.org/gestational-diabetes-causes-and-risk-factors/","txt":"Gestational Diabetes Causes and Risk Factors","extract":"It is important for both the pregnant woman and the newborn to have normal blood sugar levels throughout the pregnancy.  This is why women are generally screened for gestational diabetes between 24 and 28 weeks’ gestation.   Those women at high risk for the disorder or who show evidence of gestational diabetes (such as having glucose show up in the urine) are screened earlier in the pregnancy so that treatment can begin as soon as possible."},{"link":"https://doi.org/10.1177/0145721706294259","txt":"SAGE Journals: Your gateway to world-class journal research","extract":""},{"link":"https://diabeteslibrary.org/diabetes-and-depression/","txt":"Diabetes and Depression","extract":"\nDr Sunita Sayammagaru is practicing as a Diabetologist and an Endocrinologist from 2004. After completing undergraduate training in India, Dr.Sunita left to U.K. in 2004 and completed her higher training there. She was practising in the U.K. for 11 years before returning back to India in 2015. Dr.Sunita is currently working in Hyderabad, India."},{"link":"https://diabeteslibrary.org/gestational-diabetes-meal-plan/","txt":"Gestational Diabetes Meal Plan","extract":""},{"link":"https://doi.org/10.1186/cc6371","txt":"Tight blood glucose control decreases surgical wound infection in the cardiac surgical patient population in the ICU | Critical Care | Full Text","extract":""},{"link":"https://diabeteslibrary.org/what-causes-gestational-diabetes/","txt":"What Causes Gestational Diabetes?","extract":""},{"link":"http://www.practicaldiabetes.com/article/sweating-in-diabetes/","txt":"Sweating in diabetes - Practical DiabetesPractical Diabetes","extract":"Cystic fibrosis affects over 10 000 people in the UK and is recessively inherited. Accumulated thick, sticky mucus impairs lung function and invites infection, causes malabsorption by impairing pancreatic digestive enzyme release, and leads to liver disease. About a third of people with cystic fibrosis develop diabetes. The median survival of 40 years in cystic fibrosis is reduced by having diabetes.1 Cystic fibrosis increases chloride excretion in sweat – so diagnosis is by sweat testing.2Registration is for health professionals only and gives free access to our content."},{"link":"http://www.medicalnewstoday.com/articles/317366.php","txt":"Diabetes and abnormal sweating: What is the connection?","extract":"We do not store details you enter into this form. Please see our privacy policy for more information.Reasons for this include hormonal imbalances, cardiovascular factors, and stress. Diabetes can affect all of these.Kenny, G. P. (2016). Body temperature regulation in diabetes. https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4861190/APAHuizen, J. (2019, March 28). \"How does diabetes cause abnormal sweating?.\" Medical News Today. Retrieved fromhttps://www.medicalnewstoday.com/articles/317366.php.2019 Healthline Media UK Ltd. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional."}]}},"context":{}}