{"data":{"resourcePage":{"path":"/p/4965","iid":4965,"title":"Notes on December 25th 2017","date":"December 25th 2017","links":[{"link":"https://diabeteslibrary.org/how-to-reverse-prediabetes/","txt":"How to Reverse Prediabetes","extract":"These patients with prediabetes have a little bit of insulin resistance, which causes greater than normal blood glucose levels and which sets the stage for type 2 diabetes and the complications that come out of having the disease.  Recent research, published in The Lancet, a major medical journal, showed that prediabetics that had at least a single normal blood glucose reading, were 56 percent more likely to prevent their turning into type 2 diabetics in the next six years.\n"},{"link":"http://www.healthline.com/health/type-2-diabetes/skin-problems#overview1","txt":"Type 2 Diabetes and Skin: Pictures, Dermopathy, Infections, and More","extract":"Type 2 diabetes is a chronic metabolic condition that affects how your body utilizes glucose (sugar). This happens when the body either doesn’t respond normally to insulin or doesn’t produce enough insulin to maintain a normal blood sugar level.Decreased blood circulation can lead to changes in the skin’s collagen. This changes the skin’s texture, appearance, and ability to heal.For this reason, people with type 2 diabetes should watch out for:They’re caused by damage to the small blood vessels that supply the tissues with nutrition and oxygen. This skin problem is harmless and doesn’t require treatment. However, it often doesn’t go away, even when blood glucose is controlled.This condition is rarer than diabetic dermopathy. In the case of NLD, though, the patches are often larger in size and fewer in number. Over time, NLD skin patches may appear shiny with a red or violet border. They’re usually itchy and painful.Elevated blood sugar can increase the risk of developing digital sclerosis. Lotions, moisturizers, and regulated blood sugar levels can help prevent or treat the condition.They’re harmless, and medications are available for treatment.Blisters of this type typically occur only if blood glucose isn’t controlled.While some skin conditions associated with type 2 diabetes are mostly harmless and will go away on their own, some can be much more dangerous. If you have a flare-up of a new skin condition listed above, make an appointment to see your doctor as soon as possible."},{"link":"https://diabeteslibrary.org/gymnema-sylvestre-and-diabetes/","txt":"Gymnema Sylvestre and Diabetes","extract":"In today’s time, Gymnema sylvestre is used in the management of metabolic syndrome, diabetes mellitus, cough, and weight loss.  In Africa, it is used to treat malaria and as an antidote for snake bites.  Some Ayurvedic doctors use Gymnema sylvestre as a laxative, a diuretic, an appetite suppressant, and as a stimulant for the digestive tract."},{"link":"http://www.medscape.com/viewarticle/431617","txt":"","extract":""},{"link":"https://diabeteslibrary.org/wine-and-diabetes/","txt":"Things You Should Know About Wine and Diabetes","extract":"There is some evidence that, when a person with diabetes drinks a moderate amount of red wine per day, they could decrease their chances of heart disease.  Other evidence indicates that no amount of alcohol should be taken in by diabetics.\n"},{"link":"https://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0054962/","txt":"EXECUTIVE SUMMARY - Advanced Wound Care Therapies for Non-Healing Diabetic, Venous, and Arterial Ulcers: A Systematic Review - NCBI Bookshelf","extract":"Standard treatment for diabetic ulcers includes debridement of necrotic tissue, infection control, local ulcer care, mechanical off-loading, management of blood glucose levels, and education on foot care. For venous ulcers, standard treatment typically includes the use of mechanical compression and limb elevation to reverse tissue edema and improve venous blood flow. Care for ulcers caused by arterial insufficiency is centered on reestablishing blood flow and minimizing further loss of tissue perfusion.Few studies reported time to ulcer healing and other primary outcomes. We found no benefit in time to ulcer healing for collagen, biological dressings, or silver products. We found mixed but generally negative results for biological skin equivalents (1 of 4 Dermagraft and 1 of 3 Apligraf studies showing benefit compared to standard care), platelet-derived growth factors (4 of 8 studies reporting showing benefit compared to placebo or standard care), platelet-rich plasma (1 of 2 studies showing benefit compared to another advanced therapy), and negative pressure wound therapy (1 of 3 studies showing benefit compared to standard care). Strength of evidence was low or insufficient for all findings related to time to ulcer healing. One study of a silver dressing versus a calcium dressing reported a global outcome of healed or improved ulcers with no difference between groups. No studies reported on return to daily activities.Few studies reported time to ulcer healing. Two studies of the biological skin equivalent Apligraf found shorter time to ulcer healing as did the study comparing a keratinocyte product to standard care. Two other keratinocyte studies reported no significant differences in time to ulcer healing as did a study comparing a silver dressing to a non-silver dressing. Strength of evidence was low for these comparisons. Two studies of silver products reported higher global assessment outcomes in the silver groups; a study of electromagnetic therapy reported no difference between groups. Only studies of electromagnetic therapy reported patient activity levels; one finding no difference between treatment groups and one noting improvements pre- to post-treatment.One good quality study of wounds associated with partial foot amputation (n=162) found that NPWT (compared to standard care) improved wound healing (56% versus 39%, p=0.04) and decreased mean time to healing (56 days versus 77 days, p=0.005). There were significantly more infections in the NPWT group (17% versus 6%, p=0.04), but the incidence of other adverse events did not differ between the NPWT and standard care groups. The effects of ancillary therapies, baseline characteristics, activity level and compliance were not explored.One good quality study of ulcers associated with partial foot amputation showed a benefit of NPWT with respect to healed ulcers and mean time to healing. There were significantly more infections in the NPWT group but the incidence of other adverse events did not differ between the NPWT and standard care groups.Our systematic review of randomized controlled trials found discouragingly low strength evidence regarding the effectiveness and comparative effectiveness of advanced wound care therapies for treatment of lower extremity ulcers. This was primarily due to the fact that for each ulcer type (diabetic, venous, or arterial) individual categories of advanced wound care therapies were only evaluated in a few studies, often in highly selected populations, and frequently had conflicting findings. Furthermore, within each category of wound care therapies several different types of interventions were used making it difficult to determine if results were replicable in other studies or generalizable to broader clinical settings. Additionally, most studies compared advanced wound care therapies to standard care or placebo. Therefore there is little comparative effectiveness research evaluating one advanced wound care therapy to another. It has been noted that standard care is an inappropriate comparator for studies of advanced therapy since patients have likely already failed standard care. For arterial ulcers we identified only a single study of any advanced wound care therapy (and this was compared to standard care) despite the clinical importance of arterial ulcers.Furthermore, we did not conduct cost effectiveness analyses or assess additional costs of care associated with chronic ulcers. Despite the high costs of advanced wound care therapies it is possible that they may be cost effective or even cost saving if found to improve ulcer healing; reduce ulcer associated morbidity, hospitalizations, medical care and amputations; and improve functional status and quality of life. Based on our findings from randomized controlled trials the decision of if, when, and in whom to use advanced wound care therapies as well as the type of advanced wound care therapy selected is difficult. Additionally, because little comparative effectiveness research exists to guide choices, decisions may be based on other factors including wound care product cost, ease of use, and patient and provider preferences (the latter also influenced by personal experience with ulcer and patient characteristics).For venous ulcers, we identified only one study of the following advanced wound care therapies: collagen, biological dressings, platelet rich plasma, intermittent pneumatic compression, and hyperbaric oxygen therapy. There were no studies of platelet-derived growth factors or typical oxygen. We found no studies that reported on amputations, time to ulcer recurrence, or need for home health care related to the ulcer. One study reported hospitalization, one study reported quality of life, and two studies reported return to work or daily activities.Activity recording is turned off."},{"link":"https://diabeteslibrary.org/diabetes-prevention-methods/","txt":"Diabetes Prevention Methods","extract":"As there is currently no cure for diabetes, the condition requires lifelong treatment. The problem with diabetes is that it affects the nerves, feet, eyes, kidneys, and heart. In the United States, more than 20% of diabetics suffer from cardiovascular diseases, 10% are diagnosed with stroke, about 250 in 100,000 diabetics will need hemodialysis for kidney failure compared to 15 in 100,000 of the normal population."},{"link":"https://doi.org/10.2147/DMSO.S67400","txt":"Mechanism linking diabetes mellitus and obesity | DMSO","extract":"\n            Published 4 December 2014\n                            Volume 2014:7                                Pages 587—591                        "},{"link":"https://doi.org/10.4158/EP.9.5.406","txt":"An Error Occurred Setting Your User Cookie","extract":""},{"link":"https://diabeteslibrary.org/insulin-and-weight-gain/","txt":"Can Insulin Cause Weight Gain?","extract":""}]}},"context":{}}