{"data":{"resourcePage":{"path":"/p/5435","iid":5435,"title":"Discussions on February 21st 2018","date":"February 21st 2018","links":[{"link":"https://www.adwdiabetes.com/articles/4-reasons-for-heavy-sweating-with-diabetes-2","txt":"5 Reasons For Heavy Sweating With Diabetes | ADW Diabetes","extract":"   Notify me by email when the comment gets approved. Pet Diabetes & Care View Articles"},{"link":"https://diabeteslibrary.org/high-triglyceride-diet/","txt":"High Triglyceride Diet","extract":"There are many things you can do in order to lower your triglyceride level besides exercise.  Any time you modify your diet to reduce triglyceride intake and step up the exercise, you will lose weight, which automatically reduces the triglyceride levels by up to half of what they were originally."},{"link":"http://www.diabetes.co.uk/diabetes-complications/itchy-skin-and-diabetes.html","txt":"Itchy Skin and Diabetes - Itchiness in Legs, Feet, Ankles","extract":"Itchy skin can be a sign of diabetes,  particularly if other diabetes symptoms are also present."},{"link":"http://www.md-health.com/Diabetes-Swollen-Feet.html","txt":"How Diabetes Causes Swollen Feet and 7 Ways to Help | MD-Health.com","extract":"Diabetes can be divided into two categories – type 1 diabetes and type 2 diabetes. You develop type 2 diabetes when your blood sugar levels go up due to obesity or bad diet. This leads to several complications and most of these problems are associated with the feet."},{"link":"http://emedicine.medscape.com/article/237378-overview","txt":"Diabetic Foot Infections: Practice Essentials, Background, Pathophysiology","extract":"Burke A Cunha, MD Professor of Medicine, State University of New York School of Medicine at Stony Brook; Chief, Infectious Disease Division, Winthrop-University Hospital\n       Burke A Cunha, MD is a member of the following medical societies: American College of Chest Physicians, American College of Physicians, Infectious Diseases Society of AmericaDisclosure: Nothing to disclose."},{"link":"https://doi.org/10.1177/0145721706294259","txt":"SAGE Journals: Your gateway to world-class journal research","extract":""},{"link":"https://diabeteslibrary.org/diabetes-food-list/","txt":"Diabetes Food List","extract":""},{"link":"https://diabeteslibrary.org/diabetes-nutrition-guidelines/","txt":"Diabetes Nutrition Guidelines","extract":"In selecting a meal plan that is good for diabetics, individuals should look at their metabolic goals, such as their blood sugar levels, lipid levels, and blood pressure.  This means choosing foods that are healthy for you, low in sugar, have a low glycemic index, low fat, and low in salt."},{"link":"https://diabeteslibrary.org/insulin-to-carb-ratio/","txt":"Insulin to Carb Ratio","extract":"When using the insulin to carb ratio, it is assumed that the carbohydrates we take in are responsible for increasing the blood glucose levels.  Carbohydrates include simple sugars, fiber, complex carbohydrates, and starch.  Fiber is not usually counted as part of the insulin to carb ratio because it doesn’t break down well in the gastrointestinal tract and therefore does not increase the blood glucose levels as much as other types of carbohydrates.  Fats and protein content are not counted in the insulin to carb ratio because they, too, do not increase the blood glucose level as much as carbohydrates.\n"},{"link":"https://diabeteslibrary.org/diabetic-exchange-list/","txt":"The Diabetic Exchange List (Exchange Diet)","extract":"The exchange list was created mainly for those individuals who suffer from type 1 or type 2 diabetes; however, it can be used by anyone who needs a particular diet and even those who want to eat healthy foods as part of their daily diet plan. The foods on the exchange list are all basically healthy for you and can be used by anyone."}]}},"context":{}}