{"data":{"resourcePage":{"path":"/p/3415","iid":3415,"title":"May 25th 2019 bookmarks","date":"May 25th 2019","links":[{"link":"https://diabeteslibrary.org/diabetes-and-dry-skin/","txt":"Diabetes Dry Skin – Best Remedies","extract":""},{"link":"https://diabeteslibrary.org/diabetes-and-weight-gain/","txt":"Diabetes and Weight Gain","extract":"Insulin is a natural, protein-based hormone produced by the pancreas in normal people.  Its function is to promote the absorption of glucose into the cells to be used for cellular fuel. It also manages the absorption and storage of amino acids and fat by cells of the body that are sensitive to insulin (which are mainly the fat and muscle cells)."},{"link":"https://diabeteslibrary.org/diabetes-rash/","txt":"Diabetes Rash","extract":"Most skin rashes in diabetes are the direct result of having out of control diabetes that can be managed by getting the diabetes under good control.  This means checking the blood sugars regularly and following the doctor’s orders in treating the diabetes with medications."},{"link":"http://www.apma.org/Learn/FootHealth.cfm?ItemNumber=981","txt":"","extract":""},{"link":"https://diabeteslibrary.org/diabetes-and-nausea/","txt":"Diabetes and Nausea","extract":""},{"link":"https://doi.org/10.1186/cc6371","txt":"Tight blood glucose control decreases surgical wound infection in the cardiac surgical patient population in the ICU | Critical Care | Full Text","extract":""},{"link":"https://diabeteslibrary.org/glycated-hemoglobin-test/","txt":"Glycated Hemoglobin Test","extract":"The glycated hemoglobin test is based on the amount of sugar (glucose) attached to the hemoglobin inside of red blood cells.  Hemoglobin is the protein within the red blood cells that transfer oxygen to the tissues from the lungs.  As the red blood cells are being formed, hemoglobin is a part of the making of the cells.  If the hemoglobin is exposed to high blood glucose levels during the making of a red blood cell, the end result is an elevated glycated hemoglobin test.  A normal glycated hemoglobin level is anything less than 5.7."},{"link":"https://doi.org/10.4103/2230-8210.94253","txt":"Infections in patients with diabetes mellitus: A review of pathogenesis Casqueiro J, Casqueiro J, Alves C - Indian J Endocr Metab","extract":""},{"link":"http://www.diabetesforecast.org/2014/07-jul/13-tips-for-healthy-feet.html","txt":"13 Tips for Healthy Feet: Diabetes Forecast®","extract":""},{"link":"https://doi.org/10.4158/EP.9.5.406","txt":"An Error Occurred Setting Your User Cookie","extract":""}]}},"context":{}}